a3,a2,a1,a0 = 1,1,1,1
b3,b2,b1,b0 = 2,2,2,2

c6 = a3*b3
c5 = a3*b2 + a2*b3
c4 = a2*b2 + a3*b1 + a1*b3
c3 = a2*b1 + a1*b2 + a3*b0 + a0*b3
c2 = a1*b1 + a2*b0 + a0*b2
c1 = a1*b0 + a0*b1
c0 = a0*b0

print("(範例一)")
print("a3,a2,a1,a0 =",a3,",",a2,",",a1,",",a0)
print("b3,b2,b1,b0 =",b3,",",b2,",",b1,",",b0)
print("多項式 A = ",a3,"x^3 +",a2,"x^2",a1,"+1x +",a0)
print("多項式 B = ",b3,"x^3 +",b2,"x^2",b1,"+1x +",b0)
print("相乘結果 =",c6,"x^6 +",c5,"x^5 +",c4,"x^4 +",c3,"x^3 +",c2,"x^2 +",c1,"x +",c0)

print()

a3,a2,a1,a0 = -5,10,-6,12
b3,b2,b1,b0 = 10,8,-20,9

c6 = a3*b3
c5 = a3*b2 + a2*b3
c4 = a2*b2 + a3*b1 + a1*b3
c3 = a2*b1 + a1*b2 + a3*b0 + a0*b3
c2 = a1*b1 + a2*b0 + a0*b2
c1 = a1*b0 + a0*b1
c0 = a0*b0

print("(範例二)")
print("a3,a2,a1,a0 =",a3,",",a2,",",a1,",",a0)
print("b3,b2,b1,b0 =",b3,",",b2,",",b1,",",b0)
print("多項式 A = ",a3,"x^3 +",a2,"x^2",a1,"+1x +",a0)
print("多項式 B = ",b3,"x^3 +",b2,"x^2",b1,"+1x +",b0)
print("相乘結果 =",c6,"x^6 +",c5,"x^5 +",c4,"x^4 +",c3,"x^3 +",c2,"x^2 +",c1,"x +",c0)





